Dlubal.SteelSurfaces.ErrorType
Type of error

Dlubal.SteelSurfaces.ErrorType.UnknownErrorType
Unknown error

Dlubal.SteelSurfaces.ErrorType.UserErrorType
User error

Dlubal.SteelSurfaces.ErrorType.InternalErrorType
Internal error

Dlubal.SteelSurfaces.ErrorType.WarningType
Warning

Dlubal.SteelSurfaces.ErrorType.CalculationErrorType
Calculation error